lskrzypczak/ESP32-LED-Clock/src/main.cpp
// Array to store current time display (4 digits)
// Each element stores a pointer to the 8-byte bitmap for that digit
const uint8_t* timeDisplay[4] = {nullptr, nullptr, nullptr, nullptr};
uint8_t currentRow = 0; // Track current row being updated on the display
uint8_t rowPinValue = 0x01;

// Digit animation state
uint8_t currentDigits[4] = {0, 0, 0, 0};
uint8_t nextDigits[4] = {0, 0, 0, 0};
uint8_t animStep[4] = {DIGIT_HEIGHT, DIGIT_HEIGHT, DIGIT_HEIGHT, DIGIT_HEIGHT};
uint8_t animDelay[4] = {0, 0, 0, 0};
unsigned long lastAnimMillis = 0;
const unsigned long ANIM_STEP_MS = 80; // Animation frame duration in ms
const uint8_t ANIM_DELAY_STEPS = 2; // How many animation frames between each digit start

// Alarm state tracking
bool alarmTriggered[MAX_ALARMS] = {false};
int lastAlarmMinute = -1;
bool alarmActive = false;
int activeAlarmIndex = -1;
uint8_t activeAlarmSound = ALARM_SOUND_SIREN;
int snoozedAlarmIndex = -1;
uint32_t snoozeUntilMillis = 0;
bool alarmPlaybackInterruptible = false;

// RTOS mutex for protecting shared digit data
SemaphoreHandle_t digitMutex;
SemaphoreHandle_t alarmStateMutex;

// Task handles
TaskHandle_t webServerTaskHandle;
TaskHandle_t timeAlarmTaskHandle;
TaskHandle_t animationTaskHandle;
TaskHandle_t displayTaskHandle;
TaskHandle_t heartbeatTaskHandle;
TaskHandle_t alarmPlaybackTaskHandle;
TaskHandle_t snoozeButtonTaskHandle;

void buzzerOff();

bool isAlarmScheduledForToday(uint8_t schedule, uint8_t dayOfWeek) {
  bool isWeekend = (dayOfWeek == 0 || dayOfWeek == 6);

  switch (schedule) {
    case ALARM_SCHEDULE_WEEKDAYS:
      return !isWeekend;
    case ALARM_SCHEDULE_WEEKENDS:
      return isWeekend;
    case ALARM_SCHEDULE_SINGLE:
    case ALARM_SCHEDULE_DAILY:
    default:
      return true;
  }
}

static bool hasSnoozeExpired(uint32_t deadline) {
  return deadline != 0 && static_cast<int32_t>(millis() - deadline) >= 0;
}

static void startAlarmPlayback(int alarmIndex, uint8_t sound) {
  xSemaphoreTake(alarmStateMutex, portMAX_DELAY);
  alarmActive = true;
  activeAlarmIndex = alarmIndex;
  activeAlarmSound = sound;
  if (snoozedAlarmIndex == alarmIndex) {
    snoozedAlarmIndex = -1;
    snoozeUntilMillis = 0;
  }
  xSemaphoreGive(alarmStateMutex);
}

static void dismissActiveAlarm() {
  xSemaphoreTake(alarmStateMutex, portMAX_DELAY);
  alarmActive = false;
  activeAlarmIndex = -1;
  activeAlarmSound = ALARM_SOUND_SIREN;
  xSemaphoreGive(alarmStateMutex);
  buzzerOff();
}

static void snoozeActiveAlarm() {
  xSemaphoreTake(alarmStateMutex, portMAX_DELAY);
  if (alarmActive && activeAlarmIndex >= 0) {
    snoozedAlarmIndex = activeAlarmIndex;
    snoozeUntilMillis = millis() + (static_cast<uint32_t>(alarms[activeAlarmIndex].snoozeMinutes) * 60000UL);
  }
  alarmActive = false;
  activeAlarmIndex = -1;
  activeAlarmSound = ALARM_SOUND_SIREN;
  xSemaphoreGive(alarmStateMutex);
  buzzerOff();
}

bool shouldAbortAlarmPlayback() {
  if (!alarmPlaybackInterruptible || alarmStateMutex == nullptr) {
    return false;
  }

  bool shouldAbort = false;
  if (xSemaphoreTake(alarmStateMutex, portMAX_DELAY) == pdTRUE) {
    shouldAbort = !alarmActive;
    xSemaphoreGive(alarmStateMutex);
  }
  return shouldAbort;
}

// Helper: return the row bytes for a digit position, applying slide-up animation when active
uint8_t getDigitRow(uint8_t pos, uint8_t row) {
  // If no active animation, just return the current digit row
  if (animStep[pos] >= DIGIT_HEIGHT) {
    return Digits5x8::getDigit(currentDigits[pos])[row];
  }

  const uint8_t* oldBmp = Digits5x8::getDigit(currentDigits[pos]);
  const uint8_t* newBmp = Digits5x8::getDigit(nextDigits[pos]);
  uint8_t t = animStep[pos];

  if (row + t < DIGIT_HEIGHT) {
    return oldBmp[row + t];
  }

  uint8_t newRow = row - (DIGIT_HEIGHT - t);
  if (newRow < DIGIT_HEIGHT) {
    return newBmp[newRow];
  }

  return 0;
}

// Buzzer control functions
void buzzerOn() {
  ledcWrite(BUZZER_CHANNEL, BUZZER_DUTY_CYCLE);
}

void buzzerOff() {
  ledcWrite(BUZZER_CHANNEL, 0);
}

void playNote(unsigned int frequency, unsigned long duration) {
  const unsigned long sliceMs = 20;

  if (frequency == 0) {
    buzzerOff();
    unsigned long remaining = duration;
    while (remaining > 0) {
      if (shouldAbortAlarmPlayback()) {
        return;
      }
      unsigned long step = remaining > sliceMs ? sliceMs : remaining;
      delay(step);
      remaining -= step;
    }
  } else {
    ledcWriteTone(BUZZER_CHANNEL, frequency);
    ledcWrite(BUZZER_CHANNEL, BUZZER_DUTY_CYCLE);
    unsigned long remaining = duration;
    while (remaining > 0) {
      if (shouldAbortAlarmPlayback()) {
        buzzerOff();
        return;
      }
      unsigned long step = remaining > sliceMs ? sliceMs : remaining;
      delay(step);
      remaining -= step;
    }
    buzzerOff();
  }
}

void playSiren() {
  // Short siren sound for WiFi fallback activation
  // Rising siren: 800Hz to 1200Hz
  for (int freq = 800; freq <= 1200; freq += 50) {
    if (shouldAbortAlarmPlayback()) {
      buzzerOff();
      return;
    }
    ledcWriteTone(BUZZER_CHANNEL, freq);
    ledcWrite(BUZZER_CHANNEL, BUZZER_DUTY_CYCLE);
    delay(30);
  }
  // Falling siren: 1200Hz to 800Hz
  for (int freq = 1200; freq >= 800; freq -= 50) {
    if (shouldAbortAlarmPlayback()) {
      buzzerOff();
      return;
    }
    ledcWriteTone(BUZZER_CHANNEL, freq);
    ledcWrite(BUZZER_CHANNEL, BUZZER_DUTY_CYCLE);
    delay(30);
  }
  buzzerOff();
}

void beep(int count = 1) {
  for (int i = 0; i < count; i++) {
    playNote(1000, 100); // Beep at 1kHz for 100ms
    delay(100);
  }
}

void shortBeep() {
  playNote(1000, 10); // Beep at 1kHz for 100ms
  delay(100);
}

void playAlarmSound(uint8_t sound) {
  switch (sound) {
    case ALARM_SOUND_BEEP:
      playNote(1000, 200);
      delay(100);
      playNote(1000, 200);
      delay(100);
      playNote(1000, 200);
      break;
    case ALARM_SOUND_FANFARE:
    case ALARM_SOUND_NOKIA:
    case ALARM_SOUND_SMS:
    case ALARM_SOUND_MOTOROLA:
    case ALARM_SOUND_SIEMENS:
      playAlarmMelody(sound);
      break;
    case ALARM_SOUND_SIREN:
    default:
      playSiren();
      break;
  }
}

