lskrzypczak/ESP32-LED-Clock/src/main.cpp
// WiFi connection function with AP fallback
bool connectToWiFi() {
  Serial.println("Attempting to connect to WiFi network...");

  // Ensure we have credentials loaded (fallback to defaults if not)
  if (wifiSsid.length() == 0) wifiSsid = DEFAULT_WIFI_SSID;
  if (wifiPassword.length() == 0) wifiPassword = DEFAULT_WIFI_PASSWORD;

  Serial.print("Using SSID: ");
  Serial.println(wifiSsid);
  Serial.print("Using Password: ");
  Serial.println(wifiPassword.length() > 0 ? "[hidden]" : "[empty]");

  WiFi.begin(wifiSsid.c_str(), wifiPassword.c_str());

  int attempts = 0;
  while (WiFi.status() != WL_CONNECTED && attempts < 20) { // 20 attempts = ~10 seconds
    delay(400);
    shortBeep();
    Serial.print(".");
    attempts++;
  }
  
  if (WiFi.status() == WL_CONNECTED) {
    Serial.println("\nWiFi connected to network!");
    Serial.print("IP address: ");
    Serial.println(WiFi.localIP());
    wifiModeAP = false;
    return true;
  } else {
    Serial.println("\nWiFi network connection failed!");
    Serial.println("Starting Access Point mode as fallback...");

    WiFi.disconnect(true);
    delay(500);
    
    // Start Access Point mode
    WiFi.mode(WIFI_AP);
    if (WiFi.softAP(AP_SSID, /*AP_PASSWORD*/NULL, 13, false, 4)) {
      Serial.println("Access Point started successfully!");
      Serial.print("AP SSID: ");
      Serial.println(AP_SSID);
      Serial.print("AP IP address: ");
      Serial.println(WiFi.softAPIP());
      wifiModeAP = true;
      playSiren();  // Play siren sound to indicate AP fallback mode
      return true;
    } else {
      Serial.println("Failed to start Access Point!");
      wifiModeAP = false;
      return false;
    }
  }
}

// Web server setup function
void setupWebServer() {
  Serial.println("Setting up web server routes");
  server.on("/", handleRoot);
  server.on("/favicon.ico", HTTP_GET, handleFavicon);
  server.on("/api/status", HTTP_GET, handleApiStatus);
  server.on("/api/settime", HTTP_POST, handleApiSetTime);
  server.on("/api/wifi", HTTP_POST, handleApiWifi);
  server.on("/api/timezone", HTTP_POST, handleApiTimezone);
  server.on("/api/settings", HTTP_POST, handleApiSettings);
  server.on("/api/alarms", HTTP_POST, handleApiAlarms);
  server.on("/api/alarm/test", HTTP_POST, handleApiAlarmTest);
  server.onNotFound(handleNotFound);
  Serial.println("Web server routes registered");
}

// RTOS Task Functions
void webServerTask(void *pvParameters) {
  while (true) {
    server.handleClient();
    vTaskDelay(1 / portTICK_PERIOD_MS); // Small delay to yield
  }
}

void timeAlarmTask(void *pvParameters) {
  bool NTPSynced = 0;
  while (true) {
    DateTime now = rtc.now();

    char timeStr[9];
    rtc.getTimeString(timeStr);

    // Calculate new digit values and start animation where digits changed
    uint8_t newDigits[4] = {
      (uint8_t)(now.hour / 10),
      (uint8_t)(now.hour % 10),
      (uint8_t)(now.minute / 10),
      (uint8_t)(now.minute % 10)
    };

    xSemaphoreTake(digitMutex, portMAX_DELAY);
    for (int i = 0; i < 4; i++) {
      if (newDigits[i] != nextDigits[i]) {
        // Start animation for this digit (cascade with delay)
        currentDigits[i] = nextDigits[i];
        nextDigits[i] = newDigits[i];
        animStep[i] = 0;
        animDelay[i] = i * ANIM_DELAY_STEPS; // cascade delay based on digit position
      }
    }
    xSemaphoreGive(digitMutex);

    // Check alarms once per minute and trigger those that match
    int currentMinute = now.minute;
    if (currentMinute != lastAlarmMinute) {
      lastAlarmMinute = currentMinute;
      for (int i = 0; i < alarmCount; i++) {
        alarmTriggered[i] = false;
      }
    }

    int dueSnoozedAlarmIndex = -1;
    bool currentlyActive = false;
    if (xSemaphoreTake(alarmStateMutex, portMAX_DELAY) == pdTRUE) {
      currentlyActive = alarmActive;
      if (!alarmActive && snoozedAlarmIndex >= 0 && hasSnoozeExpired(snoozeUntilMillis)) {
        dueSnoozedAlarmIndex = snoozedAlarmIndex;
        snoozedAlarmIndex = -1;
        snoozeUntilMillis = 0;
      }
      xSemaphoreGive(alarmStateMutex);
    }

    if (dueSnoozedAlarmIndex >= 0) {
      startAlarmPlayback(dueSnoozedAlarmIndex, alarms[dueSnoozedAlarmIndex].sound);
      vTaskDelay(1000 / portTICK_PERIOD_MS);
      continue;
    }

    if (currentlyActive) {
      vTaskDelay(1000 / portTICK_PERIOD_MS);
      continue;
    }

    for (int i = 0; i < alarmCount; i++) {
      if (!alarmTriggered[i] &&
          alarms[i].enabled &&
          isAlarmScheduledForToday(alarms[i].schedule, now.dayOfWeek) &&
          now.hour == alarms[i].hour &&
          now.minute == alarms[i].minute) {
        alarmTriggered[i] = true;
        if (alarms[i].schedule == ALARM_SCHEDULE_SINGLE) {
          alarms[i].enabled = false;
          saveAlarms();
        }
        startAlarmPlayback(i, alarms[i].sound);
        break;
      }
    }

    // Synchronize RTC from network every midnight
    if ((now.hour == 0) && !NTPSynced) {
      if (!wifiModeAP) {
        Serial.println("Syncing time with NTP...");
        if (rtc.syncNTP("pool.ntp.org", getEffectiveGmtOffset(), 0)) {
          Serial.println("NTP sync successful!");
        } else {
          Serial.println("NTP sync failed, using current RTC time");
        }
      }
      NTPSynced = true; // Doesn't matter if we're succesful in syncing time.
    }
    // Reset NTP sync flag at let's say ... 08:00
    if ((now.hour == 8) && NTPSynced) {
      NTPSynced = false;
    }

    vTaskDelay(1000 / portTICK_PERIOD_MS);
  }
}

void alarmPlaybackTask(void *pvParameters) {
  while (true) {
    bool shouldPlay = false;
    uint8_t sound = ALARM_SOUND_SIREN;

    if (xSemaphoreTake(alarmStateMutex, portMAX_DELAY) == pdTRUE) {
      shouldPlay = alarmActive;
      sound = activeAlarmSound;
      xSemaphoreGive(alarmStateMutex);
    }

    if (!shouldPlay) {
      buzzerOff();
      vTaskDelay(50 / portTICK_PERIOD_MS);
      continue;
    }

    alarmPlaybackInterruptible = true;
    playAlarmSound(sound);
    alarmPlaybackInterruptible = false;

    if (shouldAbortAlarmPlayback()) {
      buzzerOff();
    }

    vTaskDelay(250 / portTICK_PERIOD_MS);
  }
}

void snoozeButtonTask(void *pvParameters) {
  const TickType_t pollDelay = 10 / portTICK_PERIOD_MS;
  const uint32_t debounceMs = 30;
  bool lastPhysicalState = digitalRead(SNOOZE_BUTTON_PIN) == LOW;
  bool debouncedPressed = lastPhysicalState;
  uint32_t lastChangeMs = millis();

  while (true) {
    bool physicalPressed = digitalRead(SNOOZE_BUTTON_PIN) == LOW;
    uint32_t nowMs = millis();

